tweeter_app_api/app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test"], ["content", "Test"], ["author", "Test"], ["created_at", "2021-01-17 02:39:25.605581"], ["updated_at", "2021-01-17 02:39:25.605581"]]

  def update
    if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "title" = $1, "content" = $2, "author" = $3, "updated_at" = $4 WHERE "tweets"."id" = $5  [["title", "Wow"], ["content", "Man"], ["author", "Cool"], ["updated_at", "2021-01-17 03:04:08.440873"], ["id", 3]]